app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at desc
SELECT COUNT(*) FROM "posts"
---
	def index
		@posts = Post.all.order("created_at desc").paginate(page: params[:page], per_page: 5)

UPDATE "posts" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_file_name", "blog-thumb-1.jpg"], ["image_file_size", 70028], ["image_updated_at", "2016-07-21 19:47:51.623716"], ["updated_at", "2016-07-21 19:47:51.763743"], ["id", 4]]
---
	def update
		if @post.update post_params

INSERT INTO "posts" ("title", "content", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test"], ["content", ""], ["slug", "test"], ["created_at", "2016-07-22 12:34:12.799279"], ["updated_at", "2016-07-22 12:34:12.799279"]]
---
	def create
		@post = Post.new post_params

		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
---
	def find_post
		@post = Post.friendly.find(params[:id])